---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductSpecificationDescription
source: html/3bb1dbe4-c356-a4d0-ab2c-67d6ef1063e5.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductSpecificationDescription Property

The product specification description of the fabrication part.

## Syntax (C#)
```csharp
public string ProductSpecificationDescription { get; }
```